// problem 1
// დაწერეთ კოდი რომელიც გაარჩევს რიცხვი კენტია თუ ლუწი

let number = 11;
if (number % 2) {
  console.log("რიცხვი კენტია");
} else {
  console.log("რიცხვი ლუწია");
}

// problem2
// დაწერეთ კოდი რომელიც მომხარებელს შეეკითხება საკუთარ სახელს შეყვანილი ინფორმაცია შეინახეთ ცვლადში.
//კონსოლში გამოიტანეთ რა შეიყვანა მომხმარებელმა
// (მომხმარებლისგან ინფორმაციის მისაღებად გამოიყენეთ prompt() ფუნქცია,)
// (კონსოლში დასაბეჭდათ გამოიყენეთ console.log() ფუნქცია )

const message = prompt("What is your name?");
console.log(message);

// problem 3
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს რიცხვი, თუ კენტ რიცხვს შეიყვანს კონსოლში დაბეჭდეთ
// რომ მომხმარებელმა შეიყვანა კენტი რიცხვი თუ ლუწს შეიყვანს მაშინ შესაბამისად კონსოლში დაბეჭდეთ
// რომ მომხარებელმა შეიყვანა ლუწი რიცხვი.
// (მომხმარებლისგან ინფორმაციის მისაღებად გამოიყენეთ prompt() ფუნქცია,)
// (კონსოლში დასაბეჭდათ გამოიყენეთ console.log() ფუნქცია )

const number1 = Number(prompt("შეიყვანეთ რიცხვი"));
if (number1 % 2) {
  console.log("რიცხვი არის კენტი");
} else {
  console.log("რიცხვი არის ლუწი");
}

// problem 4
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს მისთვის საყვარელი ხილი
// ვაშლის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'ვაშლი კარგი არჩევანია ! '
// მსხლის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'მსხალი სჯობს! '
// ყურძნის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'ყურძენი საუკეთესოა! '
// სურვილის შემთხვევაში დაამატეთ რამდენი ვარიანტიც გინდათ
// სხვა შემთხვევებში (თუ ისეთ ხილს შეიყვანს მომხმარებელი რომელიც ჩვენ არ გვიწერია ან ზოგადად ხილს არ შეიყვანს)
// კონსოლში დაბეჭდეთ "მოცემული მნიშვნელობა არ არის ჩვენს სიაში."
// დავალება შეასრულეთ Switch გამოყენებით

switch (prompt("შეიყვანეთ საყვარელი ხილი")) {
  case "ვაშლი":
    console.log("ვაშლი კარგი არჩევანია!");
    break;
  case "ყურძენი":
    console.log("ყურძენი საუკეთესოა!");
    break;
  default:
    console.log("მოცემული მნიშვნელობა არ არის ჩვენს სიაში");
}

// problem 5
// კონსოლში დაბეჭდეთ 1-100 მდე ყველა ლუწი რიცხვი

let i = 2;
while (i < 100) {
  console.log(i);
  i += 2;
}
